Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.AttributesLoaded Event
 The AttributesLoaded event is triggered just after attributes have been loaded into the dialog.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler AttributesLoaded
Public Event AttributesLoaded As EventHandler
Value
Type: System.EventHandler
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace